/***********************************************************************
 * @file heartbeat.h
 * HEARTBEAT
 * @author	:	ch
 * @brief	:	
 * @version:	v1.0
 * @Copyright (C)  2020-12-10  .cdWFVCEL. all right reserved
***********************************************************************/

#ifndef __HEARTBEAT_H_
#define __HEARTBEAT_H_
/* 包含头文件 ------------------------------------------------------------------*/
#include "ch/bsp.h"
/* 宏定义 ----------------------------------------------------------------------*/
/* 类型定义 --------------------------------------------------------------------*/
/* 变量声明 --------------------------------------------------------------------*/
extern float beatsPerMinute;
extern int beatAvg;
extern long irValue;
extern bool finger_f;
/* 函数声明 --------------------------------------------------------------------*/
void HB_Init();
void HB_Scan();
#endif // __HEARTBEAT_H_
